test/files/three_invoices_shopware.csv

"Datum des Beleges";"Datum der Bestellung";"Zahldatum";"Anrede";"Vorname";"Nachname";"Firma";"Straße";"PLZ";"Stadt";"Land";"Lieferaddr. Anrede";"Lieferaddr. Vorname";"Lieferaddr. Nachname";"Lieferaddr. Firma";"Lieferaddr. Straße";"Lieferaddr. PLZ";"Lieferaddr. Stadt";"Lieferaddr. Land";"Kundennummer";"Bestellnummer";"Dokument ID";"Bruttobetrag";"Nettobetrag";"Brutto Versandkosten";"Netto Versandkosten";"Versandkosten Steuersatz";"Bruttobetrag 0%";"Bruttobetrag 7%";"Bruttobetrag 9%";"Bruttobetrag 10%";"Bruttobetrag 13%";"Bruttobetrag 14%";"Bruttobetrag 17%";"Bruttobetrag 19%";"Bruttobetrag 20%";"Bruttobetrag 21%";"Bruttobetrag 23%";"Bruttobetrag 25%";"Waehrung";"Gesamtbetrag (EUR)";"Mwst(%)";"Mwst Betrag";"Zahlungsart";"Belegtyp";"Kundengruppe";"Kundengruppenkürzel";"Wareneinsatz";"UST ID";"Bestellstatus";"Zahlungsstatus";"Interner Kommentar";"Subshop ID";"Transaktions ID";"Cbax Externe Bestellnummer"
"2022-10-26";"2022-10-26";"2022-10-26";"mr";"TheFirstname";"TheLastname";;"TheStreet";22337;"Hamburg";"DE";"mr";"Firstname2";"Lastname2";;"TheStreet";22337;"Hamburg";"DE";1;90061;6010;59,39;53,12;4,95;4,4387957362983;0;;31,17;;;;;;23,27;;;;;"EUR";59,39;7;6,27;"PayPal";"Rechnung";"Shopkunden";"EK";0;;"Komplett ausgeliefert";"Komplett bezahlt";;1;"2342634ZEA3243245";
"2022-10-26";"2022-10-26";"2022-10-26";;"Anne";"Ümläut";;"Any Street 11";92637;"Theisseil ";"DE";;"Anne";"Ümläut";;"Any Street 11";92637;"Theisseil ";"DE";2;90062;6009;95,67;89,41;0;0;0;;95,67;;;;;;;;;;;"EUR";95,67;7;6,26;"PayPal";"Rechnung";"Shopkunden";"EK";0;;"Komplett ausgeliefert";"Komplett bezahlt";;1;"GA%$WFDS98817717542L";
"2022-10-26";"2022-10-26";"2022-10-26";;"Johnny";"Zash";;;71672;"Makenhof";"DE";;"Johnny";"Zash";;;71672;"Makenhof";"DE";3;90063;6008;124,49;116,35;0;0;0;;124,49;;;;;;;;;;;"EUR";124,49;7;8,14;"PayPal";"Rechnung";"Shopkunden";"EK";0;;"Komplett ausgeliefert";"Komplett bezahlt";;1;"%$WSFSEF§%§2SDf";
